In [2]:
import numpy as np
import pandas as pd

In [4]:
test_a_conversion = []
test_a_no_conversion = []

for _ in range(23739):
    conv = 1 if np.random.rand() > 0.8425 else 0
    no_conv = 1 if conv == 0 else 0
    
    test_a_conversion.append(conv)
    test_a_no_conversion.append(no_conv)
    
df = pd.DataFrame(
    {'conversion': test_a_conversion,
    'no conversion': test_a_no_conversion}
)

df['test'] = 'A'

In [5]:
df['test'] = 'A'

In [6]:
df

       conversion  no conversion test
0               0              1    A
1               0              1    A
2               0              1    A
3               1              0    A
4               0              1    A
...           ...            ...  ...
23734           0              1    A
23735           0              1    A
23736           0              1    A
23737           0              1    A
23738           0              1    A

[23739 rows x 3 columns]

In [7]:
test_b_conversion = []
test_b_no_conversion = []

for _ in range(22588):
    conv = 1 if np.random.rand() > 0.8057 else 0
    no_conv = 1 if conv == 0 else 0
    
    test_b_conversion.append(conv)
    test_b_no_conversion.append(no_conv)
    
df_2 = pd.DataFrame(
    {'conversion': test_b_conversion,
    'no conversion': test_b_no_conversion}
)

df_2['test'] = 'B'

In [8]:
df_2

       conversion  no conversion test
0               0              1    B
1               0              1    B
2               0              1    B
3               0              1    B
4               0              1    B
...           ...            ...  ...
22583           0              1    B
22584           1              0    B
22585           0              1    B
22586           0              1    B
22587           0              1    B

[22588 rows x 3 columns]

In [13]:
df_full = pd.concat([df, df_2], axis=0)

In [14]:
df_full = df_full.sample(frac=1).reset_index(drop=True)

In [15]:
df_full

       conversion  no conversion test
0               1              0    B
1               0              1    B
2               0              1    A
3               1              0    B
4               0              1    B
...           ...            ...  ...
46322           0              1    B
46323           0              1    B
46324           0              1    A
46325           0              1    A
46326           0              1    B

[46327 rows x 3 columns]

In [19]:
df_full.to_csv('../Datasets/ab_test-sales_pipeline.csv', index=False)

In [18]:
df_full = df_full[['test', 'conversion', 'no conversion']]

In [17]:
pd.read_csv('../Datasets/ab_test-sales_pipeline.csv')

       conversion  no conversion test
0               1              0    B
1               0              1    B
2               0              1    A
3               1              0    B
4               0              1    B
...           ...            ...  ...
46322           0              1    B
46323           0              1    B
46324           0              1    A
46325           0              1    A
46326           0              1    B

[46327 rows x 3 columns]